In [5]:
from pandas import Series,DataFrame
import numpy as np
import pandas as pd

## 7.1 基础

In [6]:
string_data=Series(['adasdad','sssssss','ddddddd',np.nan])
string_data

0    adasdad
1    sssssss
2    ddddddd
3        NaN
dtype: object

In [7]:
# 获取null的布尔型数组
string_data.isnull()

0    False
1    False
2    False
3     True
dtype: bool

## 7.2 滤除缺失数据
### （1） 使用dropna

In [8]:
from numpy import nan as NA

In [9]:
data=Series([1,NA,4.5,NA,7])

In [10]:
data.dropna()

0    1.0
2    4.5
4    7.0
dtype: float64

#### 找到非0的布尔数组

In [11]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [12]:
data[data.notnull()]

0    1.0
2    4.5
4    7.0
dtype: float64

### （2）使用dropna默认丢弃任何包含缺失值的行

In [14]:
data=DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,4.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  4.0

dropna默认丢弃任何包含缺失值的行

In [16]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

加入how关键字后只丢弃全为NA的那些行

In [18]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  4.0

### （3）丢弃列 
dropna 中通过axis=1丢弃列

In [20]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  4.0 NaN

In [21]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  4.0

使用thresh实现只留下一部分观测数据

In [23]:
df=DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.340359 -0.344817  0.622847
1  0.598807  0.209342  1.359023
2  0.980221 -0.365249 -0.451529
3 -1.105779 -0.778191  0.231782
4  0.601524 -1.081470 -0.893671
5 -2.197611 -1.314285  0.086973
6 -0.117196 -1.655663  2.030536

In [24]:
df.ix[:4,1]=NA
df.ix[:2,2]=NA
df

/Users/liusihan/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
0 -0.340359       NaN       NaN
1  0.598807       NaN       NaN
2  0.980221       NaN       NaN
3 -1.105779       NaN  0.231782
4  0.601524       NaN -0.893671
5 -2.197611 -1.314285  0.086973
6 -0.117196 -1.655663  2.030536

In [25]:
df.dropna(thresh=3)

          0         1         2
5 -2.197611 -1.314285  0.086973
6 -0.117196 -1.655663  2.030536

## 7.3 填充缺失数据
 通常使用fillna

In [26]:
df.fillna(0)

          0         1         2
0 -0.340359  0.000000  0.000000
1  0.598807  0.000000  0.000000
2  0.980221  0.000000  0.000000
3 -1.105779  0.000000  0.231782
4  0.601524  0.000000 -0.893671
5 -2.197611 -1.314285  0.086973
6 -0.117196 -1.655663  2.030536

#### 使用字典调用fillna，可以实现对不同的列填充不同的值

In [27]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -0.340359  0.500000       NaN
1  0.598807  0.500000       NaN
2  0.980221  0.500000       NaN
3 -1.105779  0.500000  0.231782
4  0.601524  0.500000 -0.893671
5 -2.197611 -1.314285  0.086973
6 -0.117196 -1.655663  2.030536

### fillna默认返回新的对象，可以通过inplace=true实现对现有对象就地修改

In [28]:
_=df.fillna(0,inplace=True)
df

          0         1         2
0 -0.340359  0.000000  0.000000
1  0.598807  0.000000  0.000000
2  0.980221  0.000000  0.000000
3 -1.105779  0.000000  0.231782
4  0.601524  0.000000 -0.893671
5 -2.197611 -1.314285  0.086973
6 -0.117196 -1.655663  2.030536